In [2]:
import pandas as pd

In [118]:
df = pd.DataFrame(data = [["A",4,5,"S1"],["B",3,4,"S2"],["C",7,2,"S1"],["D",10,12,"S1"],["A",4,5,"S1"]],index = ["c1","c2","c3","c4","c1"],columns = ["Names","Class","Age","School"])

In [85]:
df

   Names  Class  Age School
c1     A      4    5     S1
c2     B      3    4     S2
c3     C      7    2     S1
c4     D     10   12     S1
c1     A      4    5     S1

# Find out the columns

In [86]:
df.columns.to_list()

['Names', 'Class', 'Age', 'School']

In [87]:
list(df.columns)

['Names', 'Class', 'Age', 'School']

# Finding indexes

In [88]:
df.index

Index(['c1', 'c2', 'c3', 'c4', 'c1'], dtype='object')

In [89]:
df.count()

Names     5
Class     5
Age       5
School    5
dtype: int64

# Categorical counts

In [90]:
df["School"].value_counts()

School
S1    4
S2    1
Name: count, dtype: int64

In [91]:
df

   Names  Class  Age School
c1     A      4    5     S1
c2     B      3    4     S2
c3     C      7    2     S1
c4     D     10   12     S1
c1     A      4    5     S1

# Describe will perform a stastical analysis on dataframe

In [92]:
df.describe()

           Class        Age
count   5.000000   5.000000
mean    5.600000   5.600000
std     2.880972   3.781534
min     3.000000   2.000000
25%     4.000000   4.000000
50%     4.000000   5.000000
75%     7.000000   5.000000
max    10.000000  12.000000

In [93]:
df

   Names  Class  Age School
c1     A      4    5     S1
c2     B      3    4     S2
c3     C      7    2     S1
c4     D     10   12     S1
c1     A      4    5     S1

# Drop (used to drop rows or columns)

In [94]:
df = df.drop(columns = ["Age","School"])

In [95]:
df

   Names  Class
c1     A      4
c2     B      3
c3     C      7
c4     D     10
c1     A      4

In [96]:
# df.drop(columns = ["Age","School"],inplace = True)

In [97]:
df.drop(index = ["c1","c2"])

   Names  Class
c3     C      7
c4     D     10

In [98]:
df

   Names  Class
c1     A      4
c2     B      3
c3     C      7
c4     D     10
c1     A      4

# datatypes of  olumns

In [99]:
df.dtypes

Names    object
Class     int64
dtype: object

In [100]:
df

   Names  Class
c1     A      4
c2     B      3
c3     C      7
c4     D     10
c1     A      4

In [104]:
# Dealing with duplicated values

In [101]:
df.duplicated()

c1    False
c2    False
c3    False
c4    False
c1     True
dtype: bool

In [102]:
df.drop_duplicates()

   Names  Class
c1     A      4
c2     B      3
c3     C      7
c4     D     10

In [103]:
df

   Names  Class
c1     A      4
c2     B      3
c3     C      7
c4     D     10
c1     A      4

# Sort values

In [109]:
df.sort_values(by = "Names")

   Names  Class
c1     A      4
c1     A      4
c2     B      3
c3     C      7
c4     D     10

# Aggregation functions

In [114]:
df["Class"].max()

10

In [115]:
df["Class"].mean()

5.6

In [116]:
df["Class"].min()

3

# Slicing of dataframe

# call to columns

In [129]:
df

   Names  Class  Age School
c1     A      4    5     S1
c2     B      3    4     S2
c3     C      7    2     S1
c4     D     10   12     S1
c1     A      4    5     S1

In [130]:
x = df[["Names","School"]]

In [131]:
type(x)

pandas.core.frame.DataFrame

In [132]:
x

   Names School
c1     A     S1
c2     B     S2
c3     C     S1
c4     D     S1
c1     A     S1

In [137]:
y = df["Names"]

In [135]:
y

c1    A
c2    B
c3    C
c4    D
c1    A
Name: Names, dtype: object

# loc and iloc

In [138]:
# loc : locations

In [139]:
# iloc = integer locations

In [154]:
df

   Names  Class  Age School
c1     A      4    5     S1
c2     B      3    4     S2
c3     C      7    2     S1
c4     D     10   12     S1
c1     A      4    5     S1

In [156]:
df  = df.reset_index()

In [153]:
df.reset_index(drop = True)

  Names  Class  Age School
0     A      4    5     S1
1     B      3    4     S2
2     C      7    2     S1
3     D     10   12     S1
4     A      4    5     S1

In [167]:
df.loc[[0,2,3],["index","Names"]]

  index Names
0    c1     A
2    c3     C
3    c4     D

In [171]:
df.iloc[0:3,0:2]

  index Names
0    c1     A
1    c2     B
2    c3     C

In [174]:
df.loc[0:3,["index"]]

  index
0    c1
1    c2
2    c3
3    c4

# Filtering

In [176]:
df[df["index"] == "c1"]

  index Names  Class  Age School
0    c1     A      4    5     S1
4    c1     A      4    5     S1

In [182]:
df[(df["Age"] > 4) | (df["School"] != "S1")]

  index Names  Class  Age School
0    c1     A      4    5     S1
1    c2     B      3    4     S2
3    c4     D     10   12     S1
4    c1     A      4    5     S1